Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# agent.workspace.attachment.tooManyFormat
source: A run can include at most %d attachments.
ar: يمكن أن يحتوي تشغيل واحد على أقصى %d إرفاقات.
de: Ein Lauf kann maximal %d Anhänge enthalten.
es: Una ejecución puede incluir como máximo %d adjuntos.
fr: Une exécution peut inclure au maximum %d pièces jointes.
id: Satu eksekusi dapat mencakup maksimal %d lampiran.
it: Una esecuzione può includere al massimo %d allegati.
ja: 実行には最大 %d 個の添付ファイルを含めることができます。
ko: 한 번의 실행에는 최대 %d개의 첨부가 가능합니다.
nl: Een run kan maximaal %d bijvoegsels bevatten.
pl: W jednym uruchomieniu można dodać maksymalnie %d załączników.
pt_br: Uma execução pode incluir no máximo %d anexos.
ru: В одном запуске может быть не более %d прикреплений.
tr: Bir çalışma en fazla %d ekleme içerebilir.
uk: У виконанні може бути не більше %d додатків.
vi: Một lần chạy tối đa có thể chứa %d tệp đính kèm.
zh_hans: 每次运行最多添加 %d 个附件。
zh_hant: 一次執行最多可包含 %d 個附件。

# agent.workspace.attachment.totalTooLargeFormat
source: Attachments exceed the %d KB total limit.
ar: تجاوزت الإرفاقات الحد المسموح به من %d كيلوبايت في المجموع.
de: Die Anhänge überschreiten die %d KB-Gesamtgrenze.
es: Los adjuntos superan el límite total de %d KB.
fr: Les pièces jointes dépassent la limite totale de %d Ko.
id: Lampiran melebihi batas ukuran total %d KB.
it: Gli allegati superano il limite totale di %d KB.
ja: 添付ファイルは %d KB の総容量上限を超えています。
ko: 첨부 파일 총 용량이 %d KB 한도를 초과했습니다.
nl: Bijvoegsels overschrijden de %d KB totale limiet.
pl: Załączniki przekraczają limit %d KB w sumie.
pt_br: Os anexos excedem o limite total de %d KB.
ru: Прикрепления превышают общий лимит %d КБ.
tr: Eklenmiş dosyalar toplam %d KB sınırını aştı.
uk: Додатки перевищують ліміт у %d КБ.
vi: Tổng dung lượng của các tệp đính kèm vượt quá giới hạn %d KB.
zh_hans: 附件总大小超过 %d KB 限制。
zh_hant: 附件總大小超過 %d KB 的限制。

# agent.workspace.confirmation.approve
source: Approve
ar: موافقة
de: Genehmigen
es: Aprobar
fr: Approuver
id: Persetujui
it: Approva
ja: 承認する
ko: 승인
nl: Goedkeuren
pl: Zaakceptuj
pt_br: Aprovar
ru: Подтвердить
tr: Onayla
uk: Підтвердити
vi: Xác nhận
zh_hans: 批准
zh_hant: 同意

# agent.workspace.confirmation.reject
source: Reject
ar: رفض
de: Ablehnen
es: Rechazar
fr: Rejeter
id: Tolak
it: Rifiuta
ja: 拒否する
ko: 거절
nl: Afwijzen
pl: Odrzuć
pt_br: Rejeitar
ru: Отклонить
tr: Reddet
uk: Відхилити
vi: Từ chối
zh_hans: 拒绝
zh_hant: 拒絕

# agent.workspace.inspector.approval.permission
source: Permission
ar: إذن
de: Berechtigung
es: Permiso
id: Izin
it: Permesso
ja: 許可権限
ko: 권한
nl: Toegang
pl: Uprawnienia
pt_br: Permissão
ru: Разрешение
tr: İzin
uk: Розпорядження
vi: Quyền truy cập
zh_hans: 权限
zh_hant: 權限

# agent.workspace.inspector.approval.risk
source: Execution Risk
ar: خطر التنفيذ
de: Ausführungsrisiko
es: Riesgo de ejecución
fr: Risque d'exécution
id: Resiko Eksekusi
it: Rischio di esecuzione
ja: 実行リスク
ko: 실행 위험도
nl: Uitvoeringsrisico
pl: Ryzyko wykonania
pt_br: Risco de Execução
ru: Риск выполнения
tr: İşlem Riski
uk: Ризик виконання
vi: Rủi ro Thực thi
zh_hans: 执行风险
zh_hant: 執行風險

# agent.workspace.inspector.approval.riskDetail
source: Approval executes this exact tool call once. Review its arguments before allowing changes.
ar: تسمح بالموافقة على هذاrufق طلب الأداة مرة واحدة فقط. مراجعة المعلمات قبل السماح بالتغييرات.
de: Genehmigung führt diesen genauen Tool-Aufruf einmal aus. Überprüfen Sie die Argumente vor der Freigabe.
es: La aprobación ejecuta esta llamada exacta a la herramienta una vez. Revisar sus argumentos antes de permitir cambios.
fr: L'approbation exécute cet appel précis à l'outil une seule fois. Examinez ses arguments avant de permettre les modifications.
id: Persetujuan akan menjalankan panggilan alat ini sekali. Tinjau argumen sebelum membolehkan perubahan.
it: L'approvazione esegue questa chiamata specifica dello strumento una volta. Verifica gli argomenti prima di consentire modifiche.
ja: 承認はこのツールコールを1回のみ実行します。引数を確認してから変更を許可してください。
ko: 승인은 해당 도구 호출을 한 번만 실행합니다. 인수 전에 인수를 검토하세요.
nl: Goedkeuring voert deze exacte tool-aanroep één keer uit. Bekijk de argumenten voor aanpassingen voordat je toestemming geeft.
pl: Zaakceptowanie wykonuje ten konkretny wywołanie narzędzia raz. Przeglądaj argumenty przed zezwoleniem na zmiany.
pt_br: A aprovação executa essa chamada específica da ferramenta uma vez. Reveja seus argumentos antes de permitir alterações.
ru: Подтверждение выполнит этот инструмент один раз. Проверьте аргументы перед разрешением изменений.
tr: Onay, bu araç çağrısını **tek sefer** çalıştırır. Parametreleri inceledikten sonra değişikliklere izin ver.
uk: Підтвердження виконає цей інструмент один раз. Перегляньте аргументи перед дозволом змін.
vi: Xác nhận sẽ thực thi cuộc gọi công cụ này một lần duy nhất. Xem xét các tham số trước khi cho phép thay đổi.
zh_hans: 批准后仅执行这一次原始工具调用。允许写入前请核对参数。
zh_hant: 同意會執行此工具呼叫一次。檢閱其參數後再允許變更。

# agent.workspace.inspector.approval.subtitle
source: Review the pending tool call
ar: مراجعة طلب الأداة المتوقفة
de: Überprüfen Sie den anstehenden Tool-Aufruf
es: Revisar la llamada pendiente a la herramienta
fr: Examiner l'appel d'outil en attente
id: Tinjau panggilan alat yang ditunda
it: Rivedi la chiamata allo strumento in attesa
ja: 保留中のツールコールをレビューする
ko: 대기 중인 도구 호출을 검토하세요
nl: Bekijk de wachtende tool-aanroep
pl: Przeglądaj pendujące wywołanie narzędzia
pt_br: Revisar a chamada pendente da ferramenta
ru: Просмотр ожидающего вызова инструмента
tr: Bekleyen araç çağrısını inceleyin
uk: Перегляньте очікуваний виклик інструменту
vi: Xem xét cuộc gọi công cụ đang chờ
zh_hans: 审核待执行的工具调用
zh_hant: 審查待處理的工具呼叫

# agent.workspace.inspector.approval.title
source: Pending Tool
ar: أداة متوقفة
de: Wartender Tool
es: Herramienta Pendiente
fr: Outil en Attente
id: Alat Ditunda
it: Strumento in Attesa
ja: 保留中のツール
ko: 대기 중인 도구
nl: Wachtende Tool
pl: Pendujący Narzędzie
pt_br: Ferramenta Pendente
ru: Ожидающий Инструмент
tr: Bekleyen Araç
uk: Очікуваний Інструмент
vi: Công Cụ Đang Chờ
zh_hans: 待审批工具
zh_hant: 待處理工具

# agent.workspace.inspector.artifact.subtitle
source: Inspect and export the selected artifact
ar: فحص وتصدير المنتج المختار
de: Inspektion und Export des ausgewählten Artefakts
es: Inspeccionar y exportar el artefacto seleccionado
fr: Inspecter et exporter l'artefact sélectionné
id: Inspeksi dan ekspor artefak terpilih
it: Ispeziona ed esporta l'articolo selezionato
ja: 選択したアーティファクトを検査してエクスポートします
ko: 선택한 아티팩트를 검사하고 내보내세요
nl: Inspecteer en exporteer het geselecteerde artefact
pl: Inspekcja i eksport wybranego artefaktu
pt_br: Inspecionar e exportar o artefato selecionado
ru: Инспекция и экспорт выбранного артефакта
tr: Seçilen nesneyi inceleyip ihraç edin
uk: Інспекція та експорт обраного артефакту
vi: Kiểm tra và xuất tệp được chọn
zh_hans: 检查并导出当前产出物
zh_hant: 檢視並匯出選定的產物

# agent.workspace.inspector.artifactMetadataFormat
source: %@ · %d characters
ar: %@ · %d حرفًا
de: %@ · %d Zeichen
es: %@ · %d caracteres
fr: %@ · %d caractères
id: %@ · %d karakter
it: %@ · %d caratteri
ja: %@ · %d 文字
ko: %@ · %d자
nl: %@ · %d tekens
pl: %@ · %d znaków
pt_br: %@ · %d caracteres
ru: %@ · %d символов
tr: %@ · %d karakter
uk: %@ · %d символів
vi: %@ · %d ký tự
zh_hans: %@ · %d 字符
zh_hant: %@ · %d 個字元

# agent.workspace.inspector.artifactPicker
source: Artifact
ar: منتج
de: Artefakt
es: Artefacto
fr: Artefact
id: Artefak
it: Articolo
ja: アーティファクト
ko: 아티팩트
nl: Artefact
pl: Artefact
pt_br: Artefato
ru: Артефакт
tr: Nesne
uk: Артефакт
vi: Tệp Kết Quả
zh_hans: 产出物
zh_hant: 產物

# agent.workspace.inspector.copyFailed
source: Could not copy the selected artifact to the clipboard.
ar: لم يتم نسخ المنتج المختار إلى الحافظة.
de: Konnte das ausgewählte Artefakt nicht in die Zwischenablage kopieren.
es: No se pudo copiar el artefacto seleccionado al portapapeles.
fr: Impossible de copier l'artefact sélectionné dans le presse-papiers.
id: Gagal menyalin artefak terpilih ke clipboard.
it: Impossibile copiare l'articolo selezionato negli appunti.
ja: 選択したアーティファクトをクリップボードにコピーできませんでした。
ko: 선택한 아티팩트를 클립보드에 복사할 수 없습니다.
nl: Kon het geselecteerde artefact niet kopiëren naar het klembord.
pl: Nie udało się skopiować wybranego artefaktu do schowka.
pt_br: Não foi possível copiar o artefato selecionado para a área de transferência.
ru: Не удалось скопировать выбранный артефакт в буфер обмена.
tr: Seçilen nesne panoya kopyalanamadı.
uk: Не вдалося скопіювати обраний артефакт у буфер обміну.
vi: Không thể sao chép tệp được chọn vào clipboard.
zh_hans: 无法将当前产出物复制到剪贴板。
zh_hant: 無法將選定的產物複製到剪貼簿。

# agent.workspace.inspector.exportFailedFormat
source: Could not export the selected artifact: %@
ar: لم يتم تصدير المنتج المختار: %@
de: Konnte das ausgewählte Artefakt nicht exportieren: %@
es: No se pudo exportar el artefacto seleccionado: %@
fr: Impossible d'exporter l'artefact sélectionné : %@
id: Gagal mengekspor artefak terpilih: %@
it: Impossibile esportare l'articolo selezionato: %@
ja: 選択したアーティファクトのエクスポートに失敗しました: %@
ko: 선택한 아티팩트를 내보내지 못했습니다: %@
nl: Kon het geselecteerde artefact niet exporteren: %@
pl: Nie udało się eksportować wybranego artefaktu: %@
pt_br: Não foi possível exportar o artefato selecionado: %@
ru: Не удалось экспортировать выбранный артефакт: %@
tr: Seçilen nesne ihraç edilemedi: %@
uk: Не вдалося експортувати обраний артефакт: %@
vi: Không thể xuất tệp được chọn: %@
zh_hans: 无法导出当前产出物：%@
zh_hant: 無法匯出選定的產物：%@

# agent.workspace.inspector.summary.error
source: Error
ar: خطأ
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
nl: Fout
pl: Błąd
pt_br: Erro
ru: Ошибка
tr: Hata
uk: Помилка
vi: Lỗi
zh_hans: 错误
zh_hant: 錯誤

# agent.workspace.inspector.summary.messages
source: Messages
ar: رسائل
de: Nachrichten
es: Mensajes
id: Pesan
it: Messaggi
ja: メッセージ
ko: 메시지
nl: Berichten
pl: Wiadomości
pt_br: Mensagens
ru: Сообщения
tr: Mesajlar
uk: Повідомлення
vi: Thông Điệp
zh_hans: 消息
zh_hant: 訊息

# agent.workspace.inspector.summary.status
source: Status
ar: حالة
es: Estado
fr: Statut
it: Stato
ja: ステータス
ko: 상태
ru: Статус
tr: Durum
uk: Статус
vi: Trạng Thái
zh_hans: 状态
zh_hant: 狀態

# agent.workspace.inspector.summary.subtitle
source: Current run facts and usage
ar: فakten الحالية حول التشغيل واستخدامه
de: Aktuelle Laufdaten und Nutzung
es: Hechos y uso actuales de la ejecución
fr: Faits et utilisation de l'exécution actuelle
id: Fakta dan penggunaan run saat ini
it: Fatti e utilizzo della corsa corrente
ja: 現在の実行の事実と使用状況
ko: 현재 실행 사실 및 사용량
nl: Huidige run-facten en gebruik
pl: Aktualne fakty wykonania i użycie
pt_br: Fatos e uso atuais da execução
ru: Текущие факты запуска и использование
tr: Mevcut çalışma faktörleri ve kullanım
uk: Поточні факти виконання та використання
vi: Thông tin và sử dụng của lần chạy hiện tại
zh_hans: 当前运行事实与用量
zh_hant: 目前執行的事實與使用情況

# agent.workspace.inspector.summary.toolCalls
source: Tool Calls
ar: دعوات الأدوات
de: Tool-Aufrufe
es: Llamadas a Herramientas
fr: Appels d'outils
id: Panggilan Alat
it: Chiamate di Strumenti
ja: ツールコール
ko: 도구 호출
nl: Tool-aanroepen
pl: Wywołania Narzędzi
pt_br: Chamadas de Ferramenta
ru: Вызов инструментов
tr: Araç Çağrıları
uk: Виклики інструментів
vi: Cuộc Gọi Công Cụ
zh_hans: 工具调用
zh_hant: 工具呼叫

# agent.workspace.knowledgeAudit.candidates
source: Candidates
ar: مرشحين
de: Kandidaten
es: Candidatos
fr: Candidatures
id: Calon
it: Candidati
ja: 候補
ko: 후보
nl: Kandidaten
pl: Kandydatați
pt_br: Candidatos
ru: Кандидаты
tr: Adaylar
uk: Варіанти
vi: Đề xuất
zh_hans: 候选仓库
zh_hant: 候選項

# agent.workspace.knowledgeAudit.evidence
source: Evidence
ar: دليل
de: Belege
es: Pruebas
fr: Preuves
id: Bukti
it: Prove
ja: 証拠
ko: 증거
nl: Bewezenis
pl: Dowody
pt_br: Provas
ru: Доказательства
tr: Dellal
uk: Доводи
vi: Bằng chứng
zh_hans: 最终证据
zh_hant: 證據

# agent.workspace.knowledgeAudit.explicitRepositories
source: Explicit repositories
ar: مخازن صريحة
de: Explizite Repositories
es: Repositorios explícitos
fr: Dépôts explicites
id: Repository eksplisit
it: Repository espliciti
ja: 明示的なリポジトリ
ko: 명시적 저장소
nl: Expliciete repositories
pl: Wybrane repozytoria
pt_br: Repositórios explícitos
ru: Явные репозитории
tr: Açıktan depolar
uk: Явні репозиторії
vi: Những kho lưu trữ rõ ràng
zh_hans: 显式仓库
zh_hant: 明確儲存庫

# agent.workspace.knowledgeAudit.frozenRepositories
source: Frozen repositories
ar: مخازن مجمدة
de: Gefrorene Repositories
es: Repositorios congelados
fr: Dépôts figés
id: Repository beku
it: Repository congelati
ja: 凍結されたリポジトリ
ko: 동결된 저장소
nl: Gevroren repositories
pl: Zamrożone repozytoria
pt_br: Repositórios congelados
ru: Замороженные репозитории
tr: Donmuş depolar
uk: Заморожені репозиторії
vi: Những kho lưu trữ đông lạnh
zh_hans: 冻结仓库
zh_hant: 凍結儲存庫

# agent.workspace.knowledgeAudit.keywordHits
source: Keyword hits
ar: تطابقات كلمات مفتاحية
de: Schlüsselwort-Treffer
es: Coincidencias de palabras clave
fr: Correspondances de mots-clés
id: Temuan kata kunci
it: Colpi di parola chiave
ja: キーワードヒット数
ko: 키워드 일치
nl: Trefwoordenresultaten
pl: Traflenia po słowach kluczowych
pt_br: Acertos por palavra-chave
ru: Поиск по ключевым словам
tr: Anahtar kelime eşleşmeleri
uk: Ключові збіги
vi: Khớp từ khóa
zh_hans: 关键词命中
zh_hant: 關鍵字命中

# agent.workspace.knowledgeAudit.limitation.evidenceBudget
source: Some matched chunks were omitted by the Agent evidence budget.
ar: تم تجاهل بعض قطع البيانات المتطابقة بسبب ميزانية دليل الوكيل.
de: Einige passende Abschnitte wurden durch das Agenten-Belegbudget ausgelassen.
es: Algunos fragmentos coincidentes fueron omitidos por el presupuesto de pruebas del *Agent*.
fr: Certains morceaux correspondants ont été omis par le budget de preuves de l'Agent.
id: Beberapa potongan yang cocok diabaikan oleh anggaran bukti Agent.
it: Alcuni frammenti corrispondenti sono stati omessi dal budget delle prove dell'Agent.
ja: Agent の証拠予算により、一部の一致したチャンクが省略されました。
ko: Agent 증거 예산으로 인해 일부 일치 조각이 제외되었습니다.
nl: Enkele overeenkomende stukken werden weggelaten door het Agent-bewezenisbudget.
pl: Niektóre dopasowane fragmenty zostały pominięte przez limit budżetu dowodów Agent.
pt_br: Alguns fragmentos correspondentes foram omitidos pelo orçamento de provas do Agente.
ru: Некоторые совпавшие фрагменты были исключены из-за лимита доказательств Агента.
tr: Bazı eşleşen parçalar Agent deliliği bütçesi nedeniyle atlandı.
uk: Деякі збігові фрагменти були виключені через бюджет доказів Агента.
vi: Một số đoạn văn bản khớp đã bị bỏ qua do ngân sách bằng chứng của Agent.
zh_hans: 部分命中分片因 Agent 证据预算被省略。
zh_hant: 部分符合的片段因 Agent 證據預算而被省略。

# agent.workspace.knowledgeAudit.limitation.keywordUnavailable
source: Keyword retrieval was unavailable; vector retrieval remained active.
ar: كان استرجاع الكلمات المفتاحية غير متاح؛ ظل استرجاع المتجهات نشطًا.
de: Schlüsselwort-Abruf war nicht verfügbar; Vektorabruf blieb aktiv.
es: La recuperación por palabra clave no estuvo disponible; la recuperación vectorial permaneció activa.
fr: La récupération par mot-clé était indisponible ; la récupération vectorielle est restée active.
id: Pencarian kata kunci tidak tersedia; pencarian vektor tetap aktif.
it: La ricerca per parole chiave non era disponibile; la ricerca vettoriale è rimasta attiva.
ja: キーワード検索が利用できませんでした; ベクトル検索は活性化のままです。
ko: 키워드 검색이 불가능했습니다; 벡터 검색이 활성화됨
nl: Trefwoordopzoeking was niet beschikbaar; vectoropzoeking bleef actief.
pl: Pobieranie słów kluczowych było niedostępne; wyszukiwanie wektorowe pozostało aktywne.
pt_br: A recuperação por palavra-chave não estava disponível; a recuperação vetorial permaneceu ativa.
ru: Поиск по ключевым словам недоступен; векторный поиск остался активным.
tr: Anahtar kelime araması mevcut değil; vektör arama aktif kaldı.
uk: Пошук за ключовими словами був недоступний; векторний пошук залишився активним.
vi: Không thể truy xuất từ khóa; truy xuất vector vẫn hoạt động.
zh_hans: 关键词检索不可用，向量检索仍正常执行。
zh_hant: 關鍵字檢索無法使用；向量檢索仍維持活動狀態。

# agent.workspace.knowledgeAudit.limitation.noEvidence
source: No relevant indexed evidence was found in the frozen repository scope.
ar: لم يتم العثور على أي دليل مؤرخ ذي صلة في نطاق مخزن المجمد.
de: Keine relevanten indizierten Belege wurden im Bereich der gefrorenen Repositorys gefunden.
es: No se encontró evidencia relevante indexada en el alcance de repositorios congelados.
fr: Aucune preuve pertinente indexée n'a été trouvée dans le périmètre du dépôt figé.
id: Tidak ditemukan bukti yang relevan dalam cakupan repository beku.
it: Non sono state trovate prove rilevanti indicizzate nello scope del repository congelato.
ja: 凍結リポジトリ範囲内で関連する証拠が見つかりませんでした。
ko: 동결된 저장소 범위 내에 관련 증거가 없습니다.
nl: Geen relevante geïndexeerde bewezenis werd gevonden in de gevroren repository-scope.
pl: Nie znaleziono odpowiednich indeksowanych dowodów w zakresie zamrożonych repozytoriów.
pt_br: Não foram encontradas provas relevantes indexadas no escopo do repositório congelado.
ru: В заданной области замороженных репозиториев не было найдено подходящих доказательств.
tr: Donmuş depolar kapsamında ilgili delil bulunamadı.
uk: Не знайдено відповідних індексованих доказів у межах замороженого репозиторію.
vi: Không tìm thấy bất kỳ bằng chứng liên quan nào trong phạm vi kho lưu trữ đông lạnh.
zh_hans: 冻结仓库范围内未找到相关的已索引证据。
zh_hant: 在凍結儲存庫範圍內未找到相關索引證據。

# agent.workspace.knowledgeAudit.limitation.vectorUnavailable
source: Vector retrieval was unavailable; keyword retrieval remained active.
ar: كان استرجاع المتجه غير متاح؛ ظل استرجاع الكلمات المفتاحية نشطًا.
de: Vektorabruf war nicht verfügbar; Schlüsselwortabruf blieb aktiv.
es: La recuperación vectorial no estuvo disponible; la recuperación por palabra clave permaneció activa.
fr: La récupération vectorielle était indisponible ; la récupération par mot-clé est restée active.
id: Pencarian vektor tidak tersedia; pencarian kata kunci tetap aktif.
it: La ricerca vettoriale non era disponibile; la ricerca per parole chiave è rimasta attiva.
ja: ベクトル検索が利用できませんでした; キーワード検索は活性化のままです。
ko: 벡터 검색이 불가능했습니다; 키워드 검색이 활성화됨
nl: Vectoropzoeking was niet beschikbaar; trefwoordopzoeking bleef actief.
pl: Pobieranie wektorowe było niedostępne; wyszukiwanie słowami kluczowymi pozostało aktywne.
pt_br: A recuperação vetorial não estava disponível; a recuperação por palavra-chave permaneceu ativa.
ru: Векторный поиск недоступен; поиск по ключевым словам остался активным.
tr: Vektör araması mevcut değil; anahtar kelime arama aktif kaldı.
uk: Векторний пошук був недоступний; пошук за ключовими словами залишився активним.
vi: Không thể truy xuất vector; truy xuất từ khóa vẫn hoạt động.
zh_hans: 向量检索不可用，关键词检索仍正常执行。
zh_hant: 向量檢索無法使用；關鍵字檢索仍維持活動狀態。

# agent.workspace.knowledgeAudit.limitations
source: Limitations
ar: قيود
de: Einschränkungen
es: Limitaciones
id: Batasan
it: Limitazioni
ja: 制限事項
ko: 제한 사항
nl: Beperkingen
pl: Ograniczenia
pt_br: Limitações
ru: Ограничения
tr: Kısıtlamalar
uk: Обмеження
vi: Giới hạn
zh_hans: 检索限制
zh_hant: 限制

# agent.workspace.knowledgeAudit.outcome
source: Outcome
ar: نتيجة
de: Ergebnis
es: Resultado
fr: Résultat
id: Hasil
it: Esito
ja: 結果
ko: 결과
nl: Uitkomst
pl: Wynik
pt_br: Resultado
ru: Результат
tr: Sonuç
uk: Результат
vi: Kết quả
zh_hans: 检索结果
zh_hant: 結果

# agent.workspace.knowledgeAudit.scopeMode
source: Scope mode
ar: وضع النطاق
de: Bereichsmodus
es: Modo de alcance
fr: Mode de périmètre
id: Mode cakupan
it: Modalità di portata
ja: スコープモード
ko: 범위 모드
nl: Scope-modus
pl: Tryb zakresu
pt_br: Modo de escopo
ru: Режим области действия
tr: Kapsam modu
uk: Режим діапазону
vi: Chế độ phạm vi
zh_hans: 范围模式
zh_hant: 範圍模式

# agent.workspace.knowledgeAudit.semanticHits
source: Semantic hits
ar: تطابقات معنوية
de: Semantische Treffer
es: Coincidencias semánticas
fr: Correspondances sémantiques
id: Temuan semantik
it: Colpi semantici
ja: 意味的ヒット数
ko: 의미적 일치
nl: Semantische resultaten
pl: Traflenia semantyczne
pt_br: Acertos semânticos
ru: Семантические совпадения
tr: Semantik eşleşmeler
uk: Семантичні збіги
vi: Khớp ngữ nghĩa
zh_hans: 语义命中
zh_hant: 語意命中

# agent.workspace.knowledgeAudit.subtitle
source: Knowledge retrieval audit
ar: فحص استرجاع المعرفة
de: Wissensabruf-Audit
es: Auditoría de recuperación de conocimiento
fr: Audition de récupération des connaissances
id: Auditor penambahan pengetahuan
it: Audizione della ricerca delle conoscenze
ja: 知識検索のオーディット
ko: 지식 검색 감사
nl: Kennisopzoeking audit
pl: Audyt wyszukiwania wiedzy
pt_br: Áudio de recuperação de conhecimento
ru: Аудит извлечения знаний
tr: Bilgi arama denetimi
uk: Аудіт отримання знань
vi: Đánh giá truy xuất kiến thức
zh_hans: 知识检索审计
zh_hant: 知識檢索審計

# agent.workspace.knowledgeAudit.title
source: Knowledge Retrieval
ar: استرجاع المعارف
de: Wissensabfrage
es: Recuperación de Conocimiento
fr: Récupération des Connaissances
id: Pencarian Pengetahuan
it: Recupero Conoscenze
ja: 知識検索
ko: 지식 검색
nl: Kennisophaal
pl: Pobieranie Wiedzy
pt_br: Recuperação de Conhecimento
ru: Извлечение знаний
tr: Bilgi Çekme
uk: Отримання знань
vi: Lấy kiến thức
zh_hans: 知识检索
zh_hant: 知識檢索

# agent.workspace.status.waitingForConfirmation
source: Waiting for Confirmation
ar: انتظار تأكيد
de: Bestätigung wird erwartet
es: Esperando Confirmación
fr: En attente de Confirmation
id: Menunggu Konfirmasi
it: In attesa di Conferma
ja: 確認待ち
ko: 확인 대기 중
nl: Wacht op bevestiging
pl: Oczekiwanie na Potwierdzenie
pt_br: Aguardando Confirmação
ru: Ожидание подтверждения
tr: Onay Bekleniyor
uk: Чекаємо на підтвердження
vi: Đang chờ xác nhận
zh_hans: 等待确认
zh_hant: 等待確認中

# agent.workspace.timeline.approval
source: Approval
ar: التأكيد
de: Genehmigung
es: Aprobación
fr: Approbation
id: Persetujuan
it: Approvazione
ja: 承認
ko: 승인
nl: Goedkeuring
pl: Zatwierdzenie
pt_br: Aprovação
ru: Утверждение
tr: Onaylama
uk: Підтвердження
vi: Xác nhận
zh_hans: 审批
zh_hant: 審核

# agent.workspace.timeline.execution
source: Task progress
ar: تقدم المهمة
de: Aufgabenfortschritt
es: Progreso de la tarea
fr: Progression de la tâche
id: Progres tugas
it: Avanzamento attività
ja: タスクの進行状況
ko: 작업 진행 상황
nl: Taakvoortgang
pl: Postęp zadania
pt_br: Progresso da tarefa
ru: Ход выполнения задачи
tr: Görev ilerlemesi
uk: Хід виконання завдання
vi: Tiến độ tác vụ
zh_hans: 任务进展
zh_hant: 任務進度

# agent.workspace.timeline.input
source: Input
ar: الدخل
de: Eingabe
es: Entrada
fr: Entrée
id: Masukkan Masukan
ja: 入力
ko: 입력
pl: Wejście
pt_br: Entrada
ru: Ввод
tr: Giriş
uk: Ввід
vi: Nhập liệu
zh_hans: 输入
zh_hant: 輸入

# agent.workspace.timeline.output
source: Output
ar: الإخراج
de: Ausgabe
es: Salida
fr: Sortie
id: Hasil Keluaran
ja: 出力
ko: 출력
pl: Wyjście
pt_br: Saída
ru: Результат
tr: Çıktı
uk: Вихід
vi: Kết quả
zh_hans: 输出
zh_hant: 輸出

# agent.workspace.timeline.reasoning
source: Reasoning
ar: التفكير
de: Logik
es: Razonamiento
fr: Raisonnement
id: Pemikiran
it: Ragionamento
ja: 推論
ko: 추론
nl: Redenering
pl: Rozumowanie
pt_br: Raciocínio
ru: Рассуждения
tr: Akıl Yolu Çalışmaları
uk: Логіка
vi: Lý luận
zh_hans: 思考过程
zh_hant: 推理過程

# agent.workspace.timeline.reviewArguments
source: Review Arguments
ar: مراجعة الحجج
de: Argumente prüfen
es: Revisar Argumentos
fr: Revue des Arguments
id: Tinjau Argumen
it: Revisione Argomenti
ja: 引数のレビュー
ko: 인수 검토
nl: Argumenten beoordelen
pl: Przegląd Argumentów
pt_br: Revisão de Argumentos
ru: Проверка аргументов
tr: Argümanları İnceleme
uk: Перегляд аргументів
vi: Xem xét các lập luận
zh_hans: 核对参数
zh_hant: 檢視論據

# agent.workspace.timeline.sources
source: Sources
ar: المصادر
de: Quellen
es: Fuentes
id: Sumber
it: Fonti
ja: ソース
ko: 소스
nl: Bronnen
pl: Źródła
pt_br: Fontes
ru: Источники
tr: Kaynaklar
uk: Джерела
vi: Nguồn gốc
zh_hans: 来源
zh_hant: 資料來源

# agent.workspace.timeline.toolCall
source: Tool Call
ar: دعم أداة
de: Werkzeugaufruf
es: Llamada a Herramienta
fr: Appel d'outil
id: Panggilan Alat
it: Chiamata Strumento
ja: ツール呼び出し
ko: 도구 호출
nl: Tool-aanroep
pl: Wołanie Narzędzia
pt_br: Chamada de Ferramenta
ru: Вызов инструмента
tr: Araç Çağrısı
uk: Виклик інструменту
vi: Gọi công cụ
zh_hans: 工具调用
zh_hant: 工具呼叫
